package com.javarush.task.task05.task0528;

/* 
Вывести на экран сегодняшнюю дату
*/

public class Solution {
    public static void main(String[] args) {
        int d = 28;
        int m = 12;
        int y = 2017;

        System.out.println(d + " " + m + " " + y);//напишите тут ваш код
    }
}
